       IDENTIFICATION DIVISION. 
       PROGRAM-ID. PRETIMMO.

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 MONTANT_EMPRUNTER_EUR  PIC 9(7)V99 VALUE 100000.
       01 DUREE_ANNEE            PIC 9(2)    VALUE 10.
       01 DUREE_MOIS             PIC 9(6).
       01 TAUX_INTERET           PIC 9(2)V99 VALUE 3.00.

       01 COUT_TOTAL_EUR         PIC 9(7)V99.
       01 COUT_INTERET_EUR       PIC 9(7)V99.
       01 MENSUALITE             PIC 9(6)V99.

       PROCEDURE DIVISION.
           COMPUTE DUREE_MOIS = DUREE_ANNEE * 12.
           DISPLAY DUREE_MOIS.
           STOP RUN.
           